versioduo/arduino-board-package/boards.txt
# USB vendor        0x6666
#
# Every product reserves 16 USB product Ids. Operating systems MIDI stacks get
# confused if the number of exported MIDI ports change for the same USB Id, the
# number is added to the Id.
#
# Hardware:
#   axis             0xd980
#   beat             0xda30
#   control          0xd920
#   connect-hub      0xdac0
#   connect-plug     0xda90
#   connect-socket   0xda80
#   dmx              0xd9b0
#   drum             0xda50
#   express          0xd930
#   pulse            0xd960
#   radio            0xda60
#   sax              0xda70
#   step             0xd9a0
#   tee              0xdaa0
#   spot             0xdab0
#   strip            0xda20
#   wave             0xda40
#   itsybitsy        0xdf50
#
# Firmware:
#   glockenspiel-37  0xe910 (control)
#   pedal            0xe930 (itsybitsy)
#   pedal-2          0xe931 (itsybitsy)
#   kontra-2         0xe950 (control)
#   kontra-2-string  0xe960 (step)
#   schlag-7         0xe970 (control)
#   schlag-7-stepper 0xe980 (step)
#   viola-1          0xe9a0 (step)
#   frame            0xe9c0 (strip)
#   cube             0xe9d0 (wave)
#   hihat            0xe9e0 (drum)
#   snare            0xe9f0 (drum)
#   attune           0xef20 (step)
#   pi-14537         0xef30 (control)

axis.name=V2 axis
axis.vid.0=0x6666
axis.pid.0=0xd980
axis.build.vid=0x6666
axis.build.pid=0xd980
axis.build.mcu=cortex-m4
axis.build.f_cpu=120000000L
axis.build.cache_flags=-DENABLE_CACHE
axis.build.flags.optimize=-O3
axis.build.usb_product="V2 axis"
axis.build.usb_manufacturer="Versio Duo"
axis.build.usb_power=20
axis.build.board=V2_AXIS
axis.build.core=arduino
axis.build.extra_flags=-D__SAMD51G19A__ -DV2_AXIS -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
axis.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
axis.build.variant=axis
axis.build.variant_system_lib=
axis.upload.tool=bossac
axis.upload.protocol=sam-ba
axis.upload.maximum_size=245760
axis.upload.offset=0x4000
axis.upload.use_1200bps_touch=true
axis.upload.wait_for_upload_port=true
axis.upload.native_usb=true

control.name=V2 control
control.vid.0=0x6666
control.pid.0=0xd920
control.build.vid=0x6666
control.build.pid=0xd920
control.build.mcu=cortex-m4
control.build.f_cpu=120000000L
control.build.cache_flags=-DENABLE_CACHE
control.build.flags.optimize=-O3
control.build.usb_product="V2 control"
control.build.usb_manufacturer="Versio Duo"
control.build.usb_power=20
control.build.board=V2_CONTROL
control.build.core=arduino
control.build.extra_flags=-D__SAMD51G19A__ -DV2_CONTROL -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
control.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
control.build.variant=control
control.build.variant_system_lib=
control.upload.tool=bossac
control.upload.protocol=sam-ba
control.upload.maximum_size=245760
control.upload.offset=0x4000
control.upload.use_1200bps_touch=true
control.upload.wait_for_upload_port=true
control.upload.native_usb=true

beat.name=V2 beat
beat.vid.0=0x6666
beat.pid.0=0xda30
beat.build.vid=0x6666
beat.build.pid=0xda30
beat.build.mcu=cortex-m4
beat.build.f_cpu=120000000L
beat.build.cache_flags=-DENABLE_CACHE
beat.build.flags.optimize=-O3
beat.build.usb_product="V2 beat"
beat.build.usb_manufacturer="Versio Duo"
beat.build.usb_power=20
beat.build.board=V2_BEAT
beat.build.core=arduino
beat.build.extra_flags=-D__SAMD51G19A__ -DV2_BEAT -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
beat.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
beat.build.variant=beat
beat.build.variant_system_lib=
beat.upload.tool=bossac
beat.upload.protocol=sam-ba
beat.upload.maximum_size=245760
beat.upload.offset=0x4000
beat.upload.use_1200bps_touch=true
beat.upload.wait_for_upload_port=true
beat.upload.native_usb=true

connect-hub.name=V2 connect-hub
connect-hub.vid.0=0x6666
connect-hub.pid.0=0xdac0
connect-hub.build.vid=0x6666
connect-hub.build.pid=0xdac0
connect-hub.build.mcu=cortex-m4
connect-hub.build.f_cpu=120000000L
connect-hub.build.cache_flags=-DENABLE_CACHE
connect-hub.build.flags.optimize=-O3
connect-hub.build.usb_product="V2 connect-hub"
connect-hub.build.usb_manufacturer="Versio Duo"
connect-hub.build.usb_power=20
connect-hub.build.board=V2_CONNECT_HUB
connect-hub.build.core=arduino
connect-hub.build.extra_flags=-D__SAMD51J19A__ -DVV2_CONNECT_HUB -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
connect-hub.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
connect-hub.build.variant=connect-hub
connect-hub.build.variant_system_lib=
connect-hub.upload.tool=bossac
connect-hub.upload.protocol=sam-ba
connect-hub.upload.maximum_size=245760
connect-hub.upload.offset=0x4000
connect-hub.upload.use_1200bps_touch=true
connect-hub.upload.wait_for_upload_port=true
connect-hub.upload.native_usb=true

connect-plug.name=V2 connect-plug
connect-plug.vid.0=0x6666
connect-plug.pid.0=0xda90
connect-plug.build.vid=0x6666
connect-plug.build.pid=0xda90
connect-plug.build.mcu=cortex-m4
connect-plug.build.f_cpu=120000000L
connect-plug.build.cache_flags=-DENABLE_CACHE
connect-plug.build.flags.optimize=-O3
connect-plug.build.usb_product="V2 connect-plug"
connect-plug.build.usb_manufacturer="Versio Duo"
connect-plug.build.usb_power=20
connect-plug.build.board=V2_CONNECT_PLUG
connect-plug.build.core=arduino
connect-plug.build.extra_flags=-D__SAMD51J19A__ -DV2_CONNECT_PLUG -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
connect-plug.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
connect-plug.build.variant=connect-plug
connect-plug.build.variant_system_lib=
connect-plug.upload.tool=bossac
connect-plug.upload.protocol=sam-ba
connect-plug.upload.maximum_size=245760
connect-plug.upload.offset=0x4000
connect-plug.upload.use_1200bps_touch=true
connect-plug.upload.wait_for_upload_port=true
connect-plug.upload.native_usb=true

