versioduo/arduino-board-package/boards.txt
connect-socket.name=V2 connect-socket
connect-socket.vid.0=0x6666
connect-socket.pid.0=0xda80
connect-socket.build.vid=0x6666
connect-socket.build.pid=0xda80
connect-socket.build.mcu=cortex-m4
connect-socket.build.f_cpu=120000000L
connect-socket.build.cache_flags=-DENABLE_CACHE
connect-socket.build.flags.optimize=-O3
connect-socket.build.usb_product="V2 connect-socket"
connect-socket.build.usb_manufacturer="Versio Duo"
connect-socket.build.usb_power=20
connect-socket.build.board=V2_CONNECT_SOCKET
connect-socket.build.core=arduino
connect-socket.build.extra_flags=-D__SAMD51J19A__ -DV2_CONNECT_SOCKET -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
connect-socket.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
connect-socket.build.variant=connect-socket
connect-socket.build.variant_system_lib=
connect-socket.upload.tool=bossac
connect-socket.upload.protocol=sam-ba
connect-socket.upload.maximum_size=245760
connect-socket.upload.offset=0x4000
connect-socket.upload.use_1200bps_touch=true
connect-socket.upload.wait_for_upload_port=true
connect-socket.upload.native_usb=true

dmx.name=V2 dmx
dmx.vid.0=0x6666
dmx.pid.0=0xd9b0
dmx.build.vid=0x6666
dmx.build.pid=0xd9b0
dmx.build.mcu=cortex-m4
dmx.build.f_cpu=120000000L
dmx.build.cache_flags=-DENABLE_CACHE
dmx.build.flags.optimize=-O3
dmx.build.usb_product="V2 dmx"
dmx.build.usb_manufacturer="Versio Duo"
dmx.build.usb_power=20
dmx.build.board=V2_DMX
dmx.build.core=arduino
dmx.build.extra_flags=-D__SAMD51G19A__ -DV2_DMX -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
dmx.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dmx.build.variant=dmx
dmx.build.variant_system_lib=
dmx.upload.tool=bossac
dmx.upload.protocol=sam-ba
dmx.upload.maximum_size=245760
dmx.upload.offset=0x4000
dmx.upload.use_1200bps_touch=true
dmx.upload.wait_for_upload_port=true
dmx.upload.native_usb=true

drum.name=V2 drum
drum.vid.0=0x6666
drum.pid.0=0xda50
drum.vid.1=0x6666
drum.pid.1=0xe9e7
drum.vid.2=0x6666
drum.pid.2=0xe9f7
drum.build.vid=0x6666
drum.build.pid=0xda50
drum.build.mcu=cortex-m4
drum.build.f_cpu=120000000L
drum.build.cache_flags=-DENABLE_CACHE
drum.build.flags.optimize=-O3
drum.build.usb_product="V2 drum"
drum.build.usb_manufacturer="Versio Duo"
drum.build.usb_power=20
drum.build.board=V2_DRUM
drum.build.core=arduino
drum.build.extra_flags=-D__SAMD51J19A__ -DV2_DRUM -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
drum.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
drum.build.variant=drum
drum.build.variant_system_lib=
drum.upload.tool=bossac
drum.upload.protocol=sam-ba
drum.upload.maximum_size=245760
drum.upload.offset=0x4000
drum.upload.use_1200bps_touch=true
drum.upload.wait_for_upload_port=true
drum.upload.native_usb=true

express.name=V2 express
express.vid.0=0x6666
express.pid.0=0xd930
express.build.vid=0x6666
express.build.pid=0xd930
express.build.mcu=cortex-m4
express.build.f_cpu=120000000L
express.build.cache_flags=-DENABLE_CACHE
express.build.flags.optimize=-O3
express.build.usb_product="V2 express"
express.build.usb_manufacturer="Versio Duo"
express.build.usb_power=20
express.build.board=V2_EXPRESS
express.build.core=arduino
express.build.extra_flags=-D__SAMD51J19A__ -DV2_EXPRESS -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
express.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
express.build.variant=express
express.build.variant_system_lib=
express.upload.tool=bossac
express.upload.protocol=sam-ba
express.upload.maximum_size=245760
express.upload.offset=0x4000
express.upload.use_1200bps_touch=true
express.upload.wait_for_upload_port=true
express.upload.native_usb=true

pulse.name=V2 pulse
pulse.vid.0=0x6666
pulse.pid.0=0xd960
pulse.build.vid=0x6666
pulse.build.pid=0xd960
pulse.build.mcu=cortex-m4
pulse.build.f_cpu=120000000L
pulse.build.cache_flags=-DENABLE_CACHE
pulse.build.flags.optimize=-O3
pulse.build.usb_product="V2 pulse"
pulse.build.usb_manufacturer="Versio Duo"
pulse.build.usb_power=20
pulse.build.board=V2_PULSE
pulse.build.core=arduino
pulse.build.extra_flags=-D__SAMD51J19A__ -DV2_PULSE -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
pulse.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pulse.build.variant=pulse
pulse.build.variant_system_lib=
pulse.upload.tool=bossac
pulse.upload.protocol=sam-ba
pulse.upload.maximum_size=245760
pulse.upload.offset=0x4000
pulse.upload.use_1200bps_touch=true
pulse.upload.wait_for_upload_port=true
pulse.upload.native_usb=true

radio.name=V2 radio
radio.vid.0=0x6666
radio.pid.0=0xda60
radio.build.vid=0x6666
radio.build.pid=0xda60
radio.build.mcu=cortex-m4
radio.build.f_cpu=120000000L
radio.build.cache_flags=-DENABLE_CACHE
radio.build.flags.optimize=-O3
radio.build.usb_product="V2 radio"
radio.build.usb_manufacturer="Versio Duo"
radio.build.usb_power=20
radio.build.board=V2_RADIO
radio.build.core=arduino
radio.build.extra_flags=-D__SAMD51G19A__ -DV2_RADIO -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
radio.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
radio.build.variant=radio
radio.build.variant_system_lib=
radio.upload.tool=bossac
radio.upload.protocol=sam-ba
radio.upload.maximum_size=245760
radio.upload.offset=0x4000
radio.upload.use_1200bps_touch=true
radio.upload.wait_for_upload_port=true
radio.upload.native_usb=true

sax.name=V2 sax
sax.vid.0=0x6666
sax.pid.0=0xda70
sax.build.vid=0x6666
sax.build.pid=0xda70
sax.build.mcu=cortex-m4
sax.build.f_cpu=120000000L
sax.build.cache_flags=-DENABLE_CACHE
sax.build.flags.optimize=-O3
sax.build.usb_product="V2 sax"
sax.build.usb_manufacturer="Versio Duo"
sax.build.usb_power=20
sax.build.board=V2_SAX
sax.build.core=arduino
sax.build.extra_flags=-D__SAMD51J19A__ -DV2_SAX -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
sax.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sax.build.variant=sax
sax.build.variant_system_lib=
sax.upload.tool=bossac
sax.upload.protocol=sam-ba
sax.upload.maximum_size=245760
sax.upload.offset=0x4000
sax.upload.use_1200bps_touch=true
sax.upload.wait_for_upload_port=true
sax.upload.native_usb=true

spot.name=V2 spot
spot.vid.0=0x6666
spot.pid.0=0xdab0
spot.build.vid=0x6666
spot.build.pid=0xdab0
spot.build.mcu=cortex-m4
spot.build.f_cpu=120000000L
spot.build.cache_flags=-DENABLE_CACHE
spot.build.flags.optimize=-O3
spot.build.usb_product="V2 spot"
spot.build.usb_manufacturer="Versio Duo"
spot.build.usb_power=20
spot.build.board=V2_SPOT
spot.build.core=arduino
spot.build.extra_flags=-D__SAMD51J19A__ -DV2_SPOT -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
spot.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
spot.build.variant=spot
spot.build.variant_system_lib=
spot.upload.tool=bossac
spot.upload.protocol=sam-ba
spot.upload.maximum_size=245760
spot.upload.offset=0x4000
spot.upload.use_1200bps_touch=true
spot.upload.wait_for_upload_port=true
spot.upload.native_usb=true

step.name=V2 step
step.vid.0=0x6666
step.pid.0=0xd9a0
step.vid.1=0x6666
step.pid.1=0xe9a7
step.build.vid=0x6666
step.build.pid=0xd9a0
step.build.mcu=cortex-m4
step.build.f_cpu=120000000L
step.build.cache_flags=-DENABLE_CACHE
step.build.flags.optimize=-O3
step.build.usb_product="V2 step"
step.build.usb_manufacturer="Versio Duo"
step.build.usb_power=20
step.build.board=V2_STEP
step.build.core=arduino
step.build.extra_flags=-D__SAMD51J19A__ -DV2_STEP -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
step.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
step.build.variant=step
step.build.variant_system_lib=
step.upload.tool=bossac
step.upload.protocol=sam-ba
step.upload.maximum_size=245760
step.upload.offset=0x4000
step.upload.use_1200bps_touch=true
step.upload.wait_for_upload_port=true
step.upload.native_usb=true

