versioduo/arduino-board-package/boards.txt
strip.name=V2 strip
strip.vid.0=0x6666
strip.pid.0=0xda20
strip.build.vid=0x6666
strip.build.pid=0xda20
strip.build.mcu=cortex-m4
strip.build.f_cpu=120000000L
strip.build.cache_flags=-DENABLE_CACHE
strip.build.flags.optimize=-O3
strip.build.usb_product="V2 strip"
strip.build.usb_manufacturer="Versio Duo"
strip.build.usb_power=20
strip.build.board=V2_DMX
strip.build.core=arduino
strip.build.extra_flags=-D__SAMD51G19A__ -DV2_STRIP -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
strip.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
strip.build.variant=strip
strip.build.variant_system_lib=
strip.upload.tool=bossac
strip.upload.protocol=sam-ba
strip.upload.maximum_size=245760
strip.upload.offset=0x4000
strip.upload.use_1200bps_touch=true
strip.upload.wait_for_upload_port=true
strip.upload.native_usb=true

tee.name=V2 tee
tee.vid.0=0x6666
tee.pid.0=0xdaa0
tee.vid.1=0x6666
tee.pid.1=0xdaa7
tee.build.vid=0x6666
tee.build.pid=0xdaa0
tee.build.mcu=cortex-m4
tee.build.f_cpu=120000000L
tee.build.cache_flags=-DENABLE_CACHE
tee.build.flags.optimize=-O3
tee.build.usb_product="V2 tee"
tee.build.usb_manufacturer="Versio Duo"
tee.build.usb_power=20
tee.build.board=V2_TEE
tee.build.core=arduino
tee.build.extra_flags=-D__SAMD51J19A__ -DV2_TEE -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=16384
tee.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
tee.build.variant=tee
tee.build.variant_system_lib=
tee.upload.tool=bossac
tee.upload.protocol=sam-ba
tee.upload.maximum_size=245760
tee.upload.offset=0x4000
tee.upload.use_1200bps_touch=true
tee.upload.wait_for_upload_port=true
tee.upload.native_usb=true

wave.name=V2 wave
wave.vid.0=0x6666
wave.pid.0=0xda40
wave.build.vid=0x6666
wave.build.pid=0xda40
wave.build.mcu=cortex-m4
wave.build.f_cpu=120000000L
wave.build.cache_flags=-DENABLE_CACHE
wave.build.flags.optimize=-O3
wave.build.usb_product="V2 wave"
wave.build.usb_manufacturer="Versio Duo"
wave.build.usb_power=20
wave.build.board=V2_WAVE
wave.build.core=arduino
wave.build.extra_flags=-D__SAMD51J19A__ -DV2_WAVE -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4  -mfloat-abi=hard -mfpu=fpv4-sp-d16 -DSERIAL_BUFFER_SIZE=24576
wave.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
wave.build.variant=wave
wave.build.variant_system_lib=
wave.upload.tool=bossac
wave.upload.protocol=sam-ba
wave.upload.maximum_size=245760
wave.upload.offset=0x4000
wave.upload.use_1200bps_touch=true
wave.upload.wait_for_upload_port=true
wave.upload.native_usb=true

itsybitsy.name=V2 itsybitsy
itsybitsy.vid.0=0x6666
itsybitsy.pid.0=0xdf50
itsybitsy.build.vid=0x6666
itsybitsy.build.pid=0xdf50
itsybitsy.build.mcu=cortex-m4
itsybitsy.build.f_cpu=120000000L
itsybitsy.build.cache_flags=-DENABLE_CACHE
itsybitsy.build.flags.optimize=-O3
itsybitsy.build.usb_product="V2 itsybitsy"
itsybitsy.build.usb_manufacturer="Versio Duo"
itsybitsy.build.usb_power=20
itsybitsy.build.board=V2_ITSYBITSY
itsybitsy.build.core=arduino
itsybitsy.build.extra_flags=-D__SAMD51G19A__ -DV2_ITSYBITSY -D__SAMD51__ -DUSE_TINYUSB {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -DCRYSTALLESS -mfloat-abi=hard -mfpu=fpv4-sp-d16
itsybitsy.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
itsybitsy.build.variant=itsybitsy
itsybitsy.build.variant_system_lib=
itsybitsy.upload.tool=bossac
itsybitsy.upload.protocol=sam-ba
itsybitsy.upload.maximum_size=245760
itsybitsy.upload.offset=0x4000
itsybitsy.upload.use_1200bps_touch=true
itsybitsy.upload.wait_for_upload_port=true
itsybitsy.upload.native_usb=true
